newbie-jiang/STM32H750XB/cubemx_pro/STM32H750XB/BSP/LCD/lcd.c
                    LCD_WR_REG(0xC501);             //读取ID低8位
                    lcddev.id |= LCD_RD_DATA();     //读回0X10
                    HAL_Delay(5);                    //兼容1963驱动

                    if(lcddev.id==0x8000)lcddev.id=0x5510;//NT35510读回的ID是8000H,为方便区分,我们强制设置为5510
                    if(lcddev.id!=0X5510)			//也不是NT5510,尝试看看是不是SSD1963
                    {
                        LCD_WR_REG(0XA1);
                        lcddev.id=LCD_RD_DATA();
                        lcddev.id=LCD_RD_DATA();	//读回0X57
                        lcddev.id<<=8;	 
                        lcddev.id|=LCD_RD_DATA();	//读回0X61	
                        if(lcddev.id==0X5761)lcddev.id=0X1963;//SSD1963读回的ID是5761H,为方便区分,我们强制设置为1963
                    } 
                }
            }
        }  
        if(lcddev.id==0X9341)	//9341初始化
        {	 
            LCD_WR_REG(0xCF);  
            LCD_WR_DATA(0x00); 
            LCD_WR_DATA(0xC1); 
            LCD_WR_DATA(0X30); 
            LCD_WR_REG(0xED);  
            LCD_WR_DATA(0x64); 
            LCD_WR_DATA(0x03); 
            LCD_WR_DATA(0X12); 
            LCD_WR_DATA(0X81); 
            LCD_WR_REG(0xE8);  
            LCD_WR_DATA(0x85); 
            LCD_WR_DATA(0x10); 
            LCD_WR_DATA(0x7A); 
            LCD_WR_REG(0xCB);  
            LCD_WR_DATA(0x39); 
            LCD_WR_DATA(0x2C); 
            LCD_WR_DATA(0x00); 
            LCD_WR_DATA(0x34); 
            LCD_WR_DATA(0x02); 
            LCD_WR_REG(0xF7);  
            LCD_WR_DATA(0x20); 
            LCD_WR_REG(0xEA);  
            LCD_WR_DATA(0x00); 
            LCD_WR_DATA(0x00); 
            LCD_WR_REG(0xC0);    //Power control 
            LCD_WR_DATA(0x1B);   //VRH[5:0] 
            LCD_WR_REG(0xC1);    //Power control 
            LCD_WR_DATA(0x01);   //SAP[2:0];BT[3:0] 
            LCD_WR_REG(0xC5);    //VCM control 
            LCD_WR_DATA(0x30); 	 //3F
            LCD_WR_DATA(0x30); 	 //3C
            LCD_WR_REG(0xC7);    //VCM control2 
            LCD_WR_DATA(0XB7); 
            LCD_WR_REG(0x36);    // Memory Access Control 
            LCD_WR_DATA(0x48); 
            LCD_WR_REG(0x3A);   
            LCD_WR_DATA(0x55); 
            LCD_WR_REG(0xB1);   
            LCD_WR_DATA(0x00);   
            LCD_WR_DATA(0x1A); 
            LCD_WR_REG(0xB6);    // Display Function Control 
            LCD_WR_DATA(0x0A); 
            LCD_WR_DATA(0xA2); 
            LCD_WR_REG(0xF2);    // 3Gamma Function Disable 
            LCD_WR_DATA(0x00); 
            LCD_WR_REG(0x26);    //Gamma curve selected 
            LCD_WR_DATA(0x01); 
            LCD_WR_REG(0xE0);    //Set Gamma 
            LCD_WR_DATA(0x0F); 
            LCD_WR_DATA(0x2A); 
            LCD_WR_DATA(0x28); 
            LCD_WR_DATA(0x08); 
            LCD_WR_DATA(0x0E); 
            LCD_WR_DATA(0x08); 
            LCD_WR_DATA(0x54); 
            LCD_WR_DATA(0XA9); 
            LCD_WR_DATA(0x43); 
            LCD_WR_DATA(0x0A); 
            LCD_WR_DATA(0x0F); 
            LCD_WR_DATA(0x00); 
            LCD_WR_DATA(0x00); 
            LCD_WR_DATA(0x00); 
            LCD_WR_DATA(0x00); 		 
            LCD_WR_REG(0XE1);    //Set Gamma 
            LCD_WR_DATA(0x00); 
            LCD_WR_DATA(0x15); 
            LCD_WR_DATA(0x17); 
            LCD_WR_DATA(0x07); 
            LCD_WR_DATA(0x11); 
            LCD_WR_DATA(0x06); 
            LCD_WR_DATA(0x2B); 
            LCD_WR_DATA(0x56); 
            LCD_WR_DATA(0x3C); 
            LCD_WR_DATA(0x05); 
            LCD_WR_DATA(0x10); 
            LCD_WR_DATA(0x0F); 
            LCD_WR_DATA(0x3F); 
            LCD_WR_DATA(0x3F); 
            LCD_WR_DATA(0x0F); 
            LCD_WR_REG(0x2B); 
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x01);
            LCD_WR_DATA(0x3f);
            LCD_WR_REG(0x2A); 
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0xef);	 
            LCD_WR_REG(0x11); //Exit Sleep
            HAL_Delay(120);
            LCD_WR_REG(0x29); //display on	
        }
        else if(lcddev.id==0X7789)      //7789初始化
        {
             LCD_WR_REG(0x11);

            HAL_Delay(120);

            LCD_WR_REG(0x36);
            LCD_WR_DATA(0x00);


            LCD_WR_REG(0x3A);
            LCD_WR_DATA(0X05);

            LCD_WR_REG(0xB2);
            LCD_WR_DATA(0x0C);
            LCD_WR_DATA(0x0C);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x33);
            LCD_WR_DATA(0x33);

            LCD_WR_REG(0xB7);
            LCD_WR_DATA(0x35);

            LCD_WR_REG(0xBB);       //vcom
            LCD_WR_DATA(0x32);      //30

            LCD_WR_REG(0xC0);
            LCD_WR_DATA(0x0C);

            LCD_WR_REG(0xC2);
            LCD_WR_DATA(0x01);

            LCD_WR_REG(0xC3);       //vrh
            LCD_WR_DATA(0x10);      //17 0D

            LCD_WR_REG(0xC4);       //vdv
            LCD_WR_DATA(0x20);      //20

            LCD_WR_REG(0xC6);
            LCD_WR_DATA(0x0f);

            LCD_WR_REG(0xD0);
            LCD_WR_DATA(0xA4);
            LCD_WR_DATA(0xA1);

            LCD_WR_REG(0xE0);       //Set Gamma
            LCD_WR_DATA(0xd0);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x02);
            LCD_WR_DATA(0x07);
            LCD_WR_DATA(0x0a);
            LCD_WR_DATA(0x28);
            LCD_WR_DATA(0x32);
            LCD_WR_DATA(0X44);
            LCD_WR_DATA(0x42);
            LCD_WR_DATA(0x06);
            LCD_WR_DATA(0x0e);
            LCD_WR_DATA(0x12);
            LCD_WR_DATA(0x14);
            LCD_WR_DATA(0x17);


            LCD_WR_REG(0XE1);       //Set Gamma
            LCD_WR_DATA(0xd0);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x02);
            LCD_WR_DATA(0x07);
            LCD_WR_DATA(0x0a);
            LCD_WR_DATA(0x28);
            LCD_WR_DATA(0x31);
            LCD_WR_DATA(0x54);
            LCD_WR_DATA(0x47);
            LCD_WR_DATA(0x0e);
            LCD_WR_DATA(0x1c);
            LCD_WR_DATA(0x17);
            LCD_WR_DATA(0x1b);
            LCD_WR_DATA(0x1e);

            LCD_WR_REG(0x2A);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0xef);

            LCD_WR_REG(0x2B);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x01);
            LCD_WR_DATA(0x3f);

            LCD_WR_REG(0x29);       //display on
        }
        else if(lcddev.id==0x5310)
        { 
            LCD_WR_REG(0xED);
            LCD_WR_DATA(0x01);
            LCD_WR_DATA(0xFE);

            LCD_WR_REG(0xEE);
            LCD_WR_DATA(0xDE);
            LCD_WR_DATA(0x21);

            LCD_WR_REG(0xF1);
            LCD_WR_DATA(0x01);
            LCD_WR_REG(0xDF);
            LCD_WR_DATA(0x10);

            //VCOMvoltage//
            LCD_WR_REG(0xC4);
            LCD_WR_DATA(0x8F);	  //5f

            LCD_WR_REG(0xC6);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0xE2);
            LCD_WR_DATA(0xE2);
            LCD_WR_DATA(0xE2);
            LCD_WR_REG(0xBF);
            LCD_WR_DATA(0xAA);

            LCD_WR_REG(0xB0);
            LCD_WR_DATA(0x0D);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x0D);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x11);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x19);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x21);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x2D);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x3D);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x5D);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x5D);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xB1);
            LCD_WR_DATA(0x80);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x8B);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x96);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xB2);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x02);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x03);
            LCD_WR_DATA(0x00);

