newbie-jiang/STM32H750XB/cubemx_pro/STM32H750XB/BSP/LCD/lcd.c
            LCD_WR_REG(0xE8);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x99);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x87);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x88);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x77);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x66);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x88);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0xAA);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0xBB);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x99);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x66);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x55);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x55);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x44);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x44);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x55);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xE9);
            LCD_WR_DATA(0xAA);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0x00);
            LCD_WR_DATA(0xAA);

            LCD_WR_REG(0xCF);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xF0);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x50);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xF3);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0xF9);
            LCD_WR_DATA(0x06);
            LCD_WR_DATA(0x10);
            LCD_WR_DATA(0x29);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0x3A);
            LCD_WR_DATA(0x55);	//66

            LCD_WR_REG(0x11);
            HAL_Delay(100);
            LCD_WR_REG(0x29);
            LCD_WR_REG(0x35);
            LCD_WR_DATA(0x00);

            LCD_WR_REG(0x51);
            LCD_WR_DATA(0xFF);
            LCD_WR_REG(0x53);
            LCD_WR_DATA(0x2C);
            LCD_WR_REG(0x55);
            LCD_WR_DATA(0x82);
            LCD_WR_REG(0x2c);
        }else if(lcddev.id==0x5510)
        {
            LCD_WriteReg(0xF000,0x55);
            LCD_WriteReg(0xF001,0xAA);
            LCD_WriteReg(0xF002,0x52);
            LCD_WriteReg(0xF003,0x08);
            LCD_WriteReg(0xF004,0x01);
            //AVDD Set AVDD 5.2V
            LCD_WriteReg(0xB000,0x0D);
            LCD_WriteReg(0xB001,0x0D);
            LCD_WriteReg(0xB002,0x0D);
            //AVDD ratio
            LCD_WriteReg(0xB600,0x34);
            LCD_WriteReg(0xB601,0x34);
            LCD_WriteReg(0xB602,0x34);
            //AVEE -5.2V
            LCD_WriteReg(0xB100,0x0D);
            LCD_WriteReg(0xB101,0x0D);
            LCD_WriteReg(0xB102,0x0D);
            //AVEE ratio
            LCD_WriteReg(0xB700,0x34);
            LCD_WriteReg(0xB701,0x34);
            LCD_WriteReg(0xB702,0x34);
            //VCL -2.5V
            LCD_WriteReg(0xB200,0x00);
            LCD_WriteReg(0xB201,0x00);
            LCD_WriteReg(0xB202,0x00);
            //VCL ratio
            LCD_WriteReg(0xB800,0x24);
            LCD_WriteReg(0xB801,0x24);
            LCD_WriteReg(0xB802,0x24);
            //VGH 15V (Free pump)
            LCD_WriteReg(0xBF00,0x01);
            LCD_WriteReg(0xB300,0x0F);
            LCD_WriteReg(0xB301,0x0F);
            LCD_WriteReg(0xB302,0x0F);
            //VGH ratio
            LCD_WriteReg(0xB900,0x34);
            LCD_WriteReg(0xB901,0x34);
            LCD_WriteReg(0xB902,0x34);
            //VGL_REG -10V
            LCD_WriteReg(0xB500,0x08);
            LCD_WriteReg(0xB501,0x08);
            LCD_WriteReg(0xB502,0x08);
            LCD_WriteReg(0xC200,0x03);
            //VGLX ratio
            LCD_WriteReg(0xBA00,0x24);
            LCD_WriteReg(0xBA01,0x24);
            LCD_WriteReg(0xBA02,0x24);
            //VGMP/VGSP 4.5V/0V
            LCD_WriteReg(0xBC00,0x00);
            LCD_WriteReg(0xBC01,0x78);
            LCD_WriteReg(0xBC02,0x00);
            //VGMN/VGSN -4.5V/0V
            LCD_WriteReg(0xBD00,0x00);
            LCD_WriteReg(0xBD01,0x78);
            LCD_WriteReg(0xBD02,0x00);
            //VCOM
            LCD_WriteReg(0xBE00,0x00);
            LCD_WriteReg(0xBE01,0x64);
            //Gamma Setting
            LCD_WriteReg(0xD100,0x00);
            LCD_WriteReg(0xD101,0x33);
            LCD_WriteReg(0xD102,0x00);
            LCD_WriteReg(0xD103,0x34);
            LCD_WriteReg(0xD104,0x00);
            LCD_WriteReg(0xD105,0x3A);
            LCD_WriteReg(0xD106,0x00);
            LCD_WriteReg(0xD107,0x4A);
            LCD_WriteReg(0xD108,0x00);
            LCD_WriteReg(0xD109,0x5C);
            LCD_WriteReg(0xD10A,0x00);
            LCD_WriteReg(0xD10B,0x81);
            LCD_WriteReg(0xD10C,0x00);
            LCD_WriteReg(0xD10D,0xA6);
            LCD_WriteReg(0xD10E,0x00);
            LCD_WriteReg(0xD10F,0xE5);
            LCD_WriteReg(0xD110,0x01);
            LCD_WriteReg(0xD111,0x13);
            LCD_WriteReg(0xD112,0x01);
            LCD_WriteReg(0xD113,0x54);
            LCD_WriteReg(0xD114,0x01);
            LCD_WriteReg(0xD115,0x82);
            LCD_WriteReg(0xD116,0x01);
            LCD_WriteReg(0xD117,0xCA);
            LCD_WriteReg(0xD118,0x02);
            LCD_WriteReg(0xD119,0x00);
            LCD_WriteReg(0xD11A,0x02);
            LCD_WriteReg(0xD11B,0x01);
            LCD_WriteReg(0xD11C,0x02);
            LCD_WriteReg(0xD11D,0x34);
            LCD_WriteReg(0xD11E,0x02);
            LCD_WriteReg(0xD11F,0x67);
            LCD_WriteReg(0xD120,0x02);
            LCD_WriteReg(0xD121,0x84);
            LCD_WriteReg(0xD122,0x02);
            LCD_WriteReg(0xD123,0xA4);
            LCD_WriteReg(0xD124,0x02);
            LCD_WriteReg(0xD125,0xB7);
            LCD_WriteReg(0xD126,0x02);
            LCD_WriteReg(0xD127,0xCF);
            LCD_WriteReg(0xD128,0x02);
            LCD_WriteReg(0xD129,0xDE);
            LCD_WriteReg(0xD12A,0x02);
            LCD_WriteReg(0xD12B,0xF2);
            LCD_WriteReg(0xD12C,0x02);
            LCD_WriteReg(0xD12D,0xFE);
            LCD_WriteReg(0xD12E,0x03);
            LCD_WriteReg(0xD12F,0x10);
            LCD_WriteReg(0xD130,0x03);
            LCD_WriteReg(0xD131,0x33);
            LCD_WriteReg(0xD132,0x03);
            LCD_WriteReg(0xD133,0x6D);
            LCD_WriteReg(0xD200,0x00);
            LCD_WriteReg(0xD201,0x33);
            LCD_WriteReg(0xD202,0x00);
            LCD_WriteReg(0xD203,0x34);
            LCD_WriteReg(0xD204,0x00);
            LCD_WriteReg(0xD205,0x3A);
            LCD_WriteReg(0xD206,0x00);
            LCD_WriteReg(0xD207,0x4A);
            LCD_WriteReg(0xD208,0x00);
            LCD_WriteReg(0xD209,0x5C);
            LCD_WriteReg(0xD20A,0x00);

            LCD_WriteReg(0xD20B,0x81);
            LCD_WriteReg(0xD20C,0x00);
            LCD_WriteReg(0xD20D,0xA6);
            LCD_WriteReg(0xD20E,0x00);
            LCD_WriteReg(0xD20F,0xE5);
            LCD_WriteReg(0xD210,0x01);
            LCD_WriteReg(0xD211,0x13);
            LCD_WriteReg(0xD212,0x01);
            LCD_WriteReg(0xD213,0x54);
            LCD_WriteReg(0xD214,0x01);
            LCD_WriteReg(0xD215,0x82);
            LCD_WriteReg(0xD216,0x01);
            LCD_WriteReg(0xD217,0xCA);
            LCD_WriteReg(0xD218,0x02);
            LCD_WriteReg(0xD219,0x00);
            LCD_WriteReg(0xD21A,0x02);
            LCD_WriteReg(0xD21B,0x01);
            LCD_WriteReg(0xD21C,0x02);
            LCD_WriteReg(0xD21D,0x34);
            LCD_WriteReg(0xD21E,0x02);
            LCD_WriteReg(0xD21F,0x67);
            LCD_WriteReg(0xD220,0x02);
            LCD_WriteReg(0xD221,0x84);
            LCD_WriteReg(0xD222,0x02);
            LCD_WriteReg(0xD223,0xA4);
            LCD_WriteReg(0xD224,0x02);
            LCD_WriteReg(0xD225,0xB7);
            LCD_WriteReg(0xD226,0x02);
            LCD_WriteReg(0xD227,0xCF);
            LCD_WriteReg(0xD228,0x02);
            LCD_WriteReg(0xD229,0xDE);
            LCD_WriteReg(0xD22A,0x02);
            LCD_WriteReg(0xD22B,0xF2);
            LCD_WriteReg(0xD22C,0x02);
            LCD_WriteReg(0xD22D,0xFE);
            LCD_WriteReg(0xD22E,0x03);
            LCD_WriteReg(0xD22F,0x10);
            LCD_WriteReg(0xD230,0x03);
            LCD_WriteReg(0xD231,0x33);
            LCD_WriteReg(0xD232,0x03);
            LCD_WriteReg(0xD233,0x6D);
            LCD_WriteReg(0xD300,0x00);
            LCD_WriteReg(0xD301,0x33);
            LCD_WriteReg(0xD302,0x00);
            LCD_WriteReg(0xD303,0x34);
            LCD_WriteReg(0xD304,0x00);
            LCD_WriteReg(0xD305,0x3A);
            LCD_WriteReg(0xD306,0x00);
            LCD_WriteReg(0xD307,0x4A);
            LCD_WriteReg(0xD308,0x00);
            LCD_WriteReg(0xD309,0x5C);
            LCD_WriteReg(0xD30A,0x00);

            LCD_WriteReg(0xD30B,0x81);
            LCD_WriteReg(0xD30C,0x00);
            LCD_WriteReg(0xD30D,0xA6);
            LCD_WriteReg(0xD30E,0x00);
            LCD_WriteReg(0xD30F,0xE5);
            LCD_WriteReg(0xD310,0x01);
            LCD_WriteReg(0xD311,0x13);
            LCD_WriteReg(0xD312,0x01);
            LCD_WriteReg(0xD313,0x54);
            LCD_WriteReg(0xD314,0x01);
            LCD_WriteReg(0xD315,0x82);
            LCD_WriteReg(0xD316,0x01);
            LCD_WriteReg(0xD317,0xCA);
            LCD_WriteReg(0xD318,0x02);
            LCD_WriteReg(0xD319,0x00);
            LCD_WriteReg(0xD31A,0x02);
            LCD_WriteReg(0xD31B,0x01);
            LCD_WriteReg(0xD31C,0x02);
            LCD_WriteReg(0xD31D,0x34);
            LCD_WriteReg(0xD31E,0x02);
            LCD_WriteReg(0xD31F,0x67);
            LCD_WriteReg(0xD320,0x02);
            LCD_WriteReg(0xD321,0x84);
            LCD_WriteReg(0xD322,0x02);
            LCD_WriteReg(0xD323,0xA4);
            LCD_WriteReg(0xD324,0x02);
            LCD_WriteReg(0xD325,0xB7);
            LCD_WriteReg(0xD326,0x02);
            LCD_WriteReg(0xD327,0xCF);
            LCD_WriteReg(0xD328,0x02);
            LCD_WriteReg(0xD329,0xDE);
            LCD_WriteReg(0xD32A,0x02);
            LCD_WriteReg(0xD32B,0xF2);
            LCD_WriteReg(0xD32C,0x02);
            LCD_WriteReg(0xD32D,0xFE);
            LCD_WriteReg(0xD32E,0x03);
            LCD_WriteReg(0xD32F,0x10);
            LCD_WriteReg(0xD330,0x03);
            LCD_WriteReg(0xD331,0x33);
            LCD_WriteReg(0xD332,0x03);
            LCD_WriteReg(0xD333,0x6D);
            LCD_WriteReg(0xD400,0x00);
            LCD_WriteReg(0xD401,0x33);
            LCD_WriteReg(0xD402,0x00);
            LCD_WriteReg(0xD403,0x34);
            LCD_WriteReg(0xD404,0x00);
            LCD_WriteReg(0xD405,0x3A);
            LCD_WriteReg(0xD406,0x00);
            LCD_WriteReg(0xD407,0x4A);
            LCD_WriteReg(0xD408,0x00);
            LCD_WriteReg(0xD409,0x5C);
            LCD_WriteReg(0xD40A,0x00);
            LCD_WriteReg(0xD40B,0x81);

