newbie-jiang/STM32H750XB/cubemx_pro/STM32H750XB/BSP/LCD/lcd.c
            LCD_WriteReg(0xD40C,0x00);
            LCD_WriteReg(0xD40D,0xA6);
            LCD_WriteReg(0xD40E,0x00);
            LCD_WriteReg(0xD40F,0xE5);
            LCD_WriteReg(0xD410,0x01);
            LCD_WriteReg(0xD411,0x13);
            LCD_WriteReg(0xD412,0x01);
            LCD_WriteReg(0xD413,0x54);
            LCD_WriteReg(0xD414,0x01);
            LCD_WriteReg(0xD415,0x82);
            LCD_WriteReg(0xD416,0x01);
            LCD_WriteReg(0xD417,0xCA);
            LCD_WriteReg(0xD418,0x02);
            LCD_WriteReg(0xD419,0x00);
            LCD_WriteReg(0xD41A,0x02);
            LCD_WriteReg(0xD41B,0x01);
            LCD_WriteReg(0xD41C,0x02);
            LCD_WriteReg(0xD41D,0x34);
            LCD_WriteReg(0xD41E,0x02);
            LCD_WriteReg(0xD41F,0x67);
            LCD_WriteReg(0xD420,0x02);
            LCD_WriteReg(0xD421,0x84);
            LCD_WriteReg(0xD422,0x02);
            LCD_WriteReg(0xD423,0xA4);
            LCD_WriteReg(0xD424,0x02);
            LCD_WriteReg(0xD425,0xB7);
            LCD_WriteReg(0xD426,0x02);
            LCD_WriteReg(0xD427,0xCF);
            LCD_WriteReg(0xD428,0x02);
            LCD_WriteReg(0xD429,0xDE);
            LCD_WriteReg(0xD42A,0x02);
            LCD_WriteReg(0xD42B,0xF2);
            LCD_WriteReg(0xD42C,0x02);
            LCD_WriteReg(0xD42D,0xFE);
            LCD_WriteReg(0xD42E,0x03);
            LCD_WriteReg(0xD42F,0x10);
            LCD_WriteReg(0xD430,0x03);
            LCD_WriteReg(0xD431,0x33);
            LCD_WriteReg(0xD432,0x03);
            LCD_WriteReg(0xD433,0x6D);
            LCD_WriteReg(0xD500,0x00);
            LCD_WriteReg(0xD501,0x33);
            LCD_WriteReg(0xD502,0x00);
            LCD_WriteReg(0xD503,0x34);
            LCD_WriteReg(0xD504,0x00);
            LCD_WriteReg(0xD505,0x3A);
            LCD_WriteReg(0xD506,0x00);
            LCD_WriteReg(0xD507,0x4A);
            LCD_WriteReg(0xD508,0x00);
            LCD_WriteReg(0xD509,0x5C);
            LCD_WriteReg(0xD50A,0x00);
            LCD_WriteReg(0xD50B,0x81);

            LCD_WriteReg(0xD50C,0x00);
            LCD_WriteReg(0xD50D,0xA6);
            LCD_WriteReg(0xD50E,0x00);
            LCD_WriteReg(0xD50F,0xE5);
            LCD_WriteReg(0xD510,0x01);
            LCD_WriteReg(0xD511,0x13);
            LCD_WriteReg(0xD512,0x01);
            LCD_WriteReg(0xD513,0x54);
            LCD_WriteReg(0xD514,0x01);
            LCD_WriteReg(0xD515,0x82);
            LCD_WriteReg(0xD516,0x01);
            LCD_WriteReg(0xD517,0xCA);
            LCD_WriteReg(0xD518,0x02);
            LCD_WriteReg(0xD519,0x00);
            LCD_WriteReg(0xD51A,0x02);
            LCD_WriteReg(0xD51B,0x01);
            LCD_WriteReg(0xD51C,0x02);
            LCD_WriteReg(0xD51D,0x34);
            LCD_WriteReg(0xD51E,0x02);
            LCD_WriteReg(0xD51F,0x67);
            LCD_WriteReg(0xD520,0x02);
            LCD_WriteReg(0xD521,0x84);
            LCD_WriteReg(0xD522,0x02);
            LCD_WriteReg(0xD523,0xA4);
            LCD_WriteReg(0xD524,0x02);
            LCD_WriteReg(0xD525,0xB7);
            LCD_WriteReg(0xD526,0x02);
            LCD_WriteReg(0xD527,0xCF);
            LCD_WriteReg(0xD528,0x02);
            LCD_WriteReg(0xD529,0xDE);
            LCD_WriteReg(0xD52A,0x02);
            LCD_WriteReg(0xD52B,0xF2);
            LCD_WriteReg(0xD52C,0x02);
            LCD_WriteReg(0xD52D,0xFE);
            LCD_WriteReg(0xD52E,0x03);
            LCD_WriteReg(0xD52F,0x10);
            LCD_WriteReg(0xD530,0x03);
            LCD_WriteReg(0xD531,0x33);
            LCD_WriteReg(0xD532,0x03);
            LCD_WriteReg(0xD533,0x6D);
            LCD_WriteReg(0xD600,0x00);
            LCD_WriteReg(0xD601,0x33);
            LCD_WriteReg(0xD602,0x00);
            LCD_WriteReg(0xD603,0x34);
            LCD_WriteReg(0xD604,0x00);
            LCD_WriteReg(0xD605,0x3A);
            LCD_WriteReg(0xD606,0x00);
            LCD_WriteReg(0xD607,0x4A);
            LCD_WriteReg(0xD608,0x00);
            LCD_WriteReg(0xD609,0x5C);
            LCD_WriteReg(0xD60A,0x00);
            LCD_WriteReg(0xD60B,0x81);

            LCD_WriteReg(0xD60C,0x00);
            LCD_WriteReg(0xD60D,0xA6);
            LCD_WriteReg(0xD60E,0x00);
            LCD_WriteReg(0xD60F,0xE5);
            LCD_WriteReg(0xD610,0x01);
            LCD_WriteReg(0xD611,0x13);
            LCD_WriteReg(0xD612,0x01);
            LCD_WriteReg(0xD613,0x54);
            LCD_WriteReg(0xD614,0x01);
            LCD_WriteReg(0xD615,0x82);
            LCD_WriteReg(0xD616,0x01);
            LCD_WriteReg(0xD617,0xCA);
            LCD_WriteReg(0xD618,0x02);
            LCD_WriteReg(0xD619,0x00);
            LCD_WriteReg(0xD61A,0x02);
            LCD_WriteReg(0xD61B,0x01);
            LCD_WriteReg(0xD61C,0x02);
            LCD_WriteReg(0xD61D,0x34);
            LCD_WriteReg(0xD61E,0x02);
            LCD_WriteReg(0xD61F,0x67);
            LCD_WriteReg(0xD620,0x02);
            LCD_WriteReg(0xD621,0x84);
            LCD_WriteReg(0xD622,0x02);
            LCD_WriteReg(0xD623,0xA4);
            LCD_WriteReg(0xD624,0x02);
            LCD_WriteReg(0xD625,0xB7);
            LCD_WriteReg(0xD626,0x02);
            LCD_WriteReg(0xD627,0xCF);
            LCD_WriteReg(0xD628,0x02);
            LCD_WriteReg(0xD629,0xDE);
            LCD_WriteReg(0xD62A,0x02);
            LCD_WriteReg(0xD62B,0xF2);
            LCD_WriteReg(0xD62C,0x02);
            LCD_WriteReg(0xD62D,0xFE);
            LCD_WriteReg(0xD62E,0x03);
            LCD_WriteReg(0xD62F,0x10);
            LCD_WriteReg(0xD630,0x03);
            LCD_WriteReg(0xD631,0x33);
            LCD_WriteReg(0xD632,0x03);
            LCD_WriteReg(0xD633,0x6D);
            //LV2 Page 0 enable
            LCD_WriteReg(0xF000,0x55);
            LCD_WriteReg(0xF001,0xAA);
            LCD_WriteReg(0xF002,0x52);
            LCD_WriteReg(0xF003,0x08);
            LCD_WriteReg(0xF004,0x00);
            //Display control
            LCD_WriteReg(0xB100, 0xCC);
            LCD_WriteReg(0xB101, 0x00);
            //Source hold time
            LCD_WriteReg(0xB600,0x05);
            //Gate EQ control
            LCD_WriteReg(0xB700,0x70);
            LCD_WriteReg(0xB701,0x70);
            //Source EQ control (Mode 2)
            LCD_WriteReg(0xB800,0x01);
            LCD_WriteReg(0xB801,0x03);
            LCD_WriteReg(0xB802,0x03);
            LCD_WriteReg(0xB803,0x03);
            //Inversion mode (2-dot)
            LCD_WriteReg(0xBC00,0x02);
            LCD_WriteReg(0xBC01,0x00);
            LCD_WriteReg(0xBC02,0x00);
            //Timing control 4H w/ 4-delay
            LCD_WriteReg(0xC900,0xD0);
            LCD_WriteReg(0xC901,0x02);
            LCD_WriteReg(0xC902,0x50);
            LCD_WriteReg(0xC903,0x50);
            LCD_WriteReg(0xC904,0x50);
            LCD_WriteReg(0x3500,0x00);
            LCD_WriteReg(0x3A00,0x55);  //16-bit/pixel
            LCD_WR_REG(0x1100);
            delay_us(120);
            LCD_WR_REG(0x2900);  
        }else if(lcddev.id==0X1963)
        {
            LCD_WR_REG(0xE2);		//Set PLL with OSC = 10MHz (hardware),	Multiplier N = 35, 250MHz < VCO < 800MHz = OSC*(N+1), VCO = 300MHz
            LCD_WR_DATA(0x1D);		//参数1 
            LCD_WR_DATA(0x02);		//参数2 Divider M = 2, PLL = 300/(M+1) = 100MHz
            LCD_WR_DATA(0x04);		//参数3 Validate M and N values   
            delay_us(100);
            LCD_WR_REG(0xE0);		// Start PLL command
            LCD_WR_DATA(0x01);		// enable PLL
            HAL_Delay(10);
            LCD_WR_REG(0xE0);		// Start PLL command again
            LCD_WR_DATA(0x03);		// now, use PLL output as system clock	
            HAL_Delay(12);  
            LCD_WR_REG(0x01);		//软复位
            HAL_Delay(10);
            
            LCD_WR_REG(0xE6);		//设置像素频率,33Mhz
            LCD_WR_DATA(0x2F);
            LCD_WR_DATA(0xFF);
            LCD_WR_DATA(0xFF);
		
            LCD_WR_REG(0xB0);		//设置LCD模式
            LCD_WR_DATA(0x20);		//24位模式
            LCD_WR_DATA(0x00);		//TFT 模式 
        
            LCD_WR_DATA((SSD_HOR_RESOLUTION-1)>>8);//设置LCD水平像素
            LCD_WR_DATA(SSD_HOR_RESOLUTION-1);		 
            LCD_WR_DATA((SSD_VER_RESOLUTION-1)>>8);//设置LCD垂直像素
            LCD_WR_DATA(SSD_VER_RESOLUTION-1);		 
            LCD_WR_DATA(0x00);		//RGB序列 
            
            LCD_WR_REG(0xB4);		//Set horizontal period
            LCD_WR_DATA((SSD_HT-1)>>8);
            LCD_WR_DATA(SSD_HT-1);
            LCD_WR_DATA(SSD_HPS>>8);
            LCD_WR_DATA(SSD_HPS);
            LCD_WR_DATA(SSD_HOR_PULSE_WIDTH-1);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            LCD_WR_REG(0xB6);		//Set vertical period
            LCD_WR_DATA((SSD_VT-1)>>8);
            LCD_WR_DATA(SSD_VT-1);
            LCD_WR_DATA(SSD_VPS>>8);
            LCD_WR_DATA(SSD_VPS);
            LCD_WR_DATA(SSD_VER_FRONT_PORCH-1);
            LCD_WR_DATA(0x00);
            LCD_WR_DATA(0x00);
            
            LCD_WR_REG(0xF0);	//设置SSD1963与CPU接口为16bit  
            LCD_WR_DATA(0x03);	//16-bit(565 format) data for 16bpp 

            LCD_WR_REG(0x29);	//开启显示
            //设置PWM输出  背光通过占空比可调 
            LCD_WR_REG(0xD0);	//设置自动白平衡DBC
            LCD_WR_DATA(0x00);	//disable
        
